// +----------------------------------------------------------------------
// | 项目：InsunAPIServer
// +----------------------------------------------------------------------
// | 版权：Copyright (c) 1974~2019 http://insunsoft.com All rights reserved.
// +----------------------------------------------------------------------
// | 授权：Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | 作者: insunsoft-濮堂.陈剑 <951241056@QQ.com>
// +----------------------------------------------------------------------
// | 用途: 设置全局性配置参数
// +----------------------------------------------------------------------
// | 路径: \config\index.js
// +----------------------------------------------------------------------
// | 使用: const config = require('./server/config') index.js为默认名称
// +----------------------------------------------------------------------
// | 样例：config.server.API_server_port 获得设置的端口参数
// +----------------------------------------------------------------------
// | 备注：最后更新日期 2019-06-11
// +----------------------------------------------------------------------
var path = require('path');
// 通过NODE_ENV来设置环境变量，如果没有指定则默认为生产环境
var env = process.env.NODE_ENV || 'production';
env = env.toLowerCase();
// 根据环境变量载入相对应的配置文件
var file = path.resolve(__dirname,`${env}Config.js`);
try {
  var config = module.exports = require(file);
  console.log('正在加载config文件: [%s] %s', env, file);

} catch (err) {
  console.error('加载config文件失败: [%s] %s', env, file);
   throw err;
}

 